  Това е пакет за проверка на правописа за OpenOffice.org. Може
да свалите OpenOffice.org от http://openoffice.org/.
  Пакетът е продукт на проекта bgOffice. За повече
информация, прочетете файла README.bgOffice, който идва с
този пакет или посетете страницата на проекта на адрес:
http://bgoffice.sourceforge.net.


              Указания за инсталиране и настройка


1. Копирате файловете bg_BG.dic и bg_BG.aff в директорията:

  ..\OpenOffice.org\share\dict\ooo

  Ако сте инсталирали проверка на правописа на американски
английски, то в тази директория трябва да се намират файловете
en_US.aff, en_US.dic и dictionary.lst.


2. Отваряте файла dictionary.lst с текстов редактор и добавяте
следния ред на края му:

  DICT bg BG bg_BG


3. Стартирате OpenOffice и осъществявате следните настройки:
- Избирате от менюто Tools/Options;
- От менюто вляво на изскочилото диалогово прозорче избирате
  Language Settings/Writing Aids;
- От диалога вдясно избирате
  Available language modules/OpenOffice MySpell SpellChecker;
- Включвате опцията (ако не е включена);
- Избирате бутона Edit вдясно от тази опция;
- Избирате Language - Bulgarian;
- В полето долу избирате Spelling/OpenOffice MySpell
  SpellChecker и включвате опцията;
- Избирате бутона Close (за да затворите този диалогов
  прозорец);
- Натискате бутона OK (за да потвърдите настройките).


4. Ако текущият избран език не е български, то трябва да
изпълните следните стъпки за да го изберете:
- Избирате от менюто Tools/Options;
- От менюто вляво на изскочилото диалогово прозорче избирате
  Language Settings/Languages;
- Сега от същия диалог, но вдясно избирате
  Default languages for documents/Western/Bulgarian;
- В този момент пред българския език (Bulgarian) трябва да
  виждате знака за проверка на правописа (малка икона с отметка
  на фона на буквите ABC). Това означава, че новите настройки са
  възприети;
- Натискате бутона OK (за да потвърдите промените).


5. В този момент проверката на правописа трябва да функционира.
Ако имате проблеми, опитайте се да ги разрешите и да ми пишете.


  Всяка помощ е добра дошла. Търсят се доброволци да помагат.


  OOo-spell-bg
  Авторски права (C) 2001 Радостин Раднев <radnev@gmail.com>

  OOo-spell-bg
  Copyright (C) 2001 Radostin Radnev <radnev@gmail.com>
